#Importer Pandas

In [2]:
import pandas as pd

#Import des dataset

In [3]:
df1 = pd.read_csv("csv_files/user_device.csv")
df2 = pd.read_csv("csv_files/user_usage.csv")
df3 = pd.read_csv("csv_files/android_devices.csv")

#Renommer Retail Branding

In [47]:
df3 = df3.rename(columns={'Retail Branding': 'Manufacturer'})
df3 = df3.rename(columns={'Device': 'device'})

#Afficher les dataset

In [4]:
df1

,use_id,user_id,platform,platform_version,device,use_type_id
0,22782,26980,ios,10.2,"iPhone7,2",2
1,22783,29628,android,6.0,Nexus 5,3
2,22784,28473,android,5.1,SM-G903F,1
3,22785,15200,ios,10.2,"iPhone7,2",3
4,22786,28239,android,6.0,ONE E1003,1
...,...,...,...,...,...,...
267,23049,29725,android,6.0,SM-G900F,1
268,23050,29726,ios,10.2,"iPhone7,2",3
269,23051,29726,ios,10.2,"iPhone7,2",3
270,23052,29727,ios,10.1,"iPhone8,4",3
271,23053,20257,android,5.1,Vodafone Smart ultra 6,1

In [5]:
df2

     outgoing_mins_per_month  outgoing_sms_per_month  monthly_mb  use_id
0                      21.97                    4.82     1557.33   22787
1                    1710.08                  136.88     7267.55   22788
2                    1710.08                  136.88     7267.55   22789
3                      94.46                   35.17      519.12   22790
4                      71.59                   79.26     1557.33   22792
..                       ...                     ...         ...     ...
235                   260.66                   68.44      896.96   25008
236                    97.12                   36.50     2815.00   25040
237                   355.93                   12.37     6828.09   25046
238                   632.06                  120.46     1453.16   25058
239                   488.70                  906.92     3089.85   25220

[240 rows x 4 columns]

In [25]:
df3

      Manufacturer Marketing Name       Device                      Model
0              NaN            NaN       AD681H  Smartfren Andromax AD681H
1              NaN            NaN        FJL21                      FJL21
2              NaN            NaN          T31              Panasonic T31
3              NaN            NaN     hws7721g         MediaPad 7 Youth 2
4               3Q        OC1020A      OC1020A                    OC1020A
...            ...            ...          ...                        ...
14541        pendo    PNDPP44QC10  PNDPP44QC10                PNDPP44QC10
14542        pendo     PNDPP44QC7   PNDPP44QC7                 PNDPP44QC7
14543   sugar_aums         QPOINT        QPI-1                      QPI-1
14544    tecmobile       OmnisOne     OmnisOne                  Omnis One
14545        ucall          EASY1        EASY1                      EASY1

[14546 rows x 4 columns]

#Le premier Merge

In [94]:
df4 = pd.merge(df1[["use_id", "platform", "device"]], df2, on="use_id")
df4

,use_id,platform,device,outgoing_mins_per_month,outgoing_sms_per_month,monthly_mb
0,22787,android,GT-I9505,21.97,4.82,1557.33
1,22788,android,SM-G930F,1710.08,136.88,7267.55
2,22789,android,SM-G930F,1710.08,136.88,7267.55
3,22790,android,D2303,94.46,35.17,519.12
4,22792,android,SM-G361F,71.59,79.26,1557.33
...,...,...,...,...,...,...
154,23043,android,SM-G900F,198.59,90.49,5191.12
155,23044,android,SM-G900F,198.59,90.49,3114.67
156,23046,android,Moto G (4),106.65,82.13,5191.12
157,23049,android,SM-G900F,344.53,20.53,519.12
158,23053,android,Vodafone Smart ultra 6,42.75,46.83,5191.12

#Affichage des shape des dataframe ainsi que celle du résultat du merge

In [92]:
print("user_device dimension : ", df1.shape)
print("user_usage dimension : ", df2.shape)
print(df4.shape)

user_device dimension :  (272, 6)
user_usage dimension :  (240, 4)
(159, 6)

#Afficher via value_counts les use_id présent dans le nouveau dataset ainsi que ceux non présent

In [132]:
df2["use_id"].isin(df4["use_id"]).value_counts()

True     159
False     81
Name: use_id, dtype: int64

In [182]:
merge_left = pd.merge(df2, df1[["use_id", "platform", "device"]], left_on="use_id", right_on="use_id", how="left")

In [141]:
print("user_usage dimensions:", df2.shape)
print("result dimensions:", merge_left.shape)

user_usage dimensions: (240, 4)
result dimensions: (240, 6)

In [142]:
merge_left.head(5)

,outgoing_mins_per_month,outgoing_sms_per_month,monthly_mb,use_id,platform,device
0,21.97,4.82,1557.33,22787,android,GT-I9505
1,1710.08,136.88,7267.55,22788,android,SM-G930F
2,1710.08,136.88,7267.55,22789,android,SM-G930F
3,94.46,35.17,519.12,22790,android,D2303
4,71.59,79.26,1557.33,22792,android,SM-G361F

In [184]:
merge_left.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 240 entries, 0 to 239
Data columns (total 6 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   outgoing_mins_per_month  240 non-null    float64
 1   outgoing_sms_per_month   240 non-null    float64
 2   monthly_mb               240 non-null    float64
 3   use_id                   240 non-null    int64
 4   platform                 159 non-null    object
 5   device                   159 non-null    object
dtypes: float64(3), int64(1), object(2)
memory usage: 13.1+ KB

In [65]:
merge_right = pd.merge(df2, df1[["use_id", "platform", "device"]], how="right")

In [67]:
print("user_device dimensions:", df1.shape)
print("result dimensions:", merge_right.shape)
print("There are", merge_right["monthly_mb"].isna().sum(),"missing values in the 'monthly_mb' column in the result.")
print("There are", merge_right["platform"].isna().sum(),"missing values in the 'platform' column in the result.")

user_device dimensions: (272, 6)
result dimensions: (272, 6)
There are 113 missing values in the 'monthly_mb' column in the result.
There are 0 missing values in the 'platform' column in the result.

In [5]:
merge_outer = pd.merge(df2, df1[["use_id", "platform", "device"]], how="outer")

In [6]:
merge_outer.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 353 entries, 0 to 352
Data columns (total 6 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   outgoing_mins_per_month  240 non-null    float64
 1   outgoing_sms_per_month   240 non-null    float64
 2   monthly_mb               240 non-null    float64
 3   use_id                   353 non-null    int64
 4   platform                 272 non-null    object
 5   device                   272 non-null    object
dtypes: float64(3), int64(1), object(2)
memory usage: 19.3+ KB

In [7]:
merge_outer.isna().sum()

outgoing_mins_per_month    113
outgoing_sms_per_month     113
monthly_mb                 113
use_id                       0
platform                    81
device                      81
dtype: int64

In [8]:
c = merge_outer["outgoing_mins_per_month"]

In [9]:
merge_outer.dropna()

,outgoing_mins_per_month,outgoing_sms_per_month,monthly_mb,use_id,platform,device
0,21.97,4.82,1557.33,22787,android,GT-I9505
1,1710.08,136.88,7267.55,22788,android,SM-G930F
2,1710.08,136.88,7267.55,22789,android,SM-G930F
3,94.46,35.17,519.12,22790,android,D2303
4,71.59,79.26,1557.33,22792,android,SM-G361F
...,...,...,...,...,...,...
154,198.59,90.49,5191.12,23043,android,SM-G900F
155,198.59,90.49,3114.67,23044,android,SM-G900F
156,106.65,82.13,5191.12,23046,android,Moto G (4)
157,344.53,20.53,519.12,23049,android,SM-G900F
158,42.75,46.83,5191.12,23053,android,Vodafone Smart ultra 6

In [10]:
merge_outer.fillna(value=merge_outer.median())

,outgoing_mins_per_month,outgoing_sms_per_month,monthly_mb,use_id,platform,device
0,21.970,4.820,1557.330,22787,android,GT-I9505
1,1710.080,136.880,7267.550,22788,android,SM-G930F
2,1710.080,136.880,7267.550,22789,android,SM-G930F
3,94.460,35.170,519.120,22790,android,D2303
4,71.590,79.260,1557.330,22792,android,SM-G361F
...,...,...,...,...,...,...
348,189.705,70.775,1797.975,23047,ios,"iPhone7,1"
349,189.705,70.775,1797.975,23048,android,ONEPLUS A3003
350,189.705,70.775,1797.975,23050,ios,"iPhone7,2"
351,189.705,70.775,1797.975,23051,ios,"iPhone7,2"
352,189.705,70.775,1797.975,23052,ios,"iPhone8,4"

In [11]:
d = merge_outer.copy()
for col in d:
    if d[col].dtypes != 'O' and col != "use_id":
        print(col,":", d[col].dtypes)

outgoing_mins_per_month : float64
outgoing_sms_per_month : float64
monthly_mb : float64

In [12]:
d = merge_outer.copy()
for col in d:
    if d[col].dtypes != 'O' and col != "use_id":
        d[col] = d[col].fillna(value=d[col].median())

merge_outer

,outgoing_mins_per_month,outgoing_sms_per_month,monthly_mb,use_id,platform,device
0,21.97,4.82,1557.33,22787,android,GT-I9505
1,1710.08,136.88,7267.55,22788,android,SM-G930F
2,1710.08,136.88,7267.55,22789,android,SM-G930F
3,94.46,35.17,519.12,22790,android,D2303
4,71.59,79.26,1557.33,22792,android,SM-G361F
...,...,...,...,...,...,...
348,NaN,NaN,NaN,23047,ios,"iPhone7,1"
349,NaN,NaN,NaN,23048,android,ONEPLUS A3003
350,NaN,NaN,NaN,23050,ios,"iPhone7,2"
351,NaN,NaN,NaN,23051,ios,"iPhone7,2"
352,NaN,NaN,NaN,23052,ios,"iPhone8,4"

In [13]:
d.select_dtypes("float64")

     outgoing_mins_per_month  outgoing_sms_per_month  monthly_mb
0                     21.970                   4.820    1557.330
1                   1710.080                 136.880    7267.550
2                   1710.080                 136.880    7267.550
3                     94.460                  35.170     519.120
4                     71.590                  79.260    1557.330
..                       ...                     ...         ...
348                  189.705                  70.775    1797.975
349                  189.705                  70.775    1797.975
350                  189.705                  70.775    1797.975
351                  189.705                  70.775    1797.975
352                  189.705                  70.775    1797.975

[353 rows x 3 columns]

In [14]:
merge_outer.shape

(353, 6)

#Afficher les lignes 0,1,200,201,350,351

In [43]:
merge_outer.loc[[0, 1, 200, 201, 350, 351]]

,outgoing_mins_per_month,outgoing_sms_per_month,monthly_mb,use_id,platform,device
0,21.97,4.82,1557.33,22787,android,GT-I9505
1,1710.08,136.88,7267.55,22788,android,SM-G930F
200,28.79,29.42,3114.67,23988,NaN,NaN
201,616.56,99.85,5414.14,24006,NaN,NaN
350,NaN,NaN,NaN,23050,ios,"iPhone7,2"
351,NaN,NaN,NaN,23051,ios,"iPhone7,2"

In [77]:
merge_device_manufacturer = pd.merge(merge_outer, df3[["Manufacturer", "Model"]], left_on="device", right_on="Model")

#Afficher les device commencant par 'GT'¶

In [70]:
df3[df3.evice.str.startswith('GT')]

      Manufacturer          Marketing Name     device      Model
1095       Bitmore                 GTAB700    GTAB700   NID_7010
1096       Bitmore                 GTAB900    GTAB900       S952
2402       Grundig                 GTB1050    GTB1050   GTB 1050
2403       Grundig                  GTB850     GTB850    GTB 850
2404       Grundig                 TC69CA2     GTB801    GTB 801
...            ...                     ...        ...        ...
10821      Samsung            Galaxy Y Pro  GT-B5510L  GT-B5510L
10822      Samsung       Galaxy Y Pro Duos   GT-B5512   GT-B5512
10823      Samsung       Galaxy Y Pro Duos  GT-B5512B  GT-B5512B
10824      Samsung             Galaxy Y TV   GT-S5367   GT-S5367
10979        Sharp  AQUOS SERIE mini SHV38        GTQ      SHV38

[164 rows x 4 columns]

#Grouper vos données par manufacturer

#Afficher le dataset des résultats

In [79]:
merge_device_manufacturer

,outgoing_mins_per_month,outgoing_sms_per_month,monthly_mb,use_id,platform,device,Manufacturer,Model
0,21.97,4.82,1557.33,22787,android,GT-I9505,Samsung,GT-I9505
1,69.80,14.70,25955.55,22801,android,GT-I9505,Samsung,GT-I9505
2,249.26,253.22,1557.33,22875,android,GT-I9505,Samsung,GT-I9505
3,249.26,253.22,1557.33,22876,android,GT-I9505,Samsung,GT-I9505
4,83.46,114.06,3114.67,22880,android,GT-I9505,Samsung,GT-I9505
...,...,...,...,...,...,...,...,...
227,NaN,NaN,NaN,22786,android,ONE E1003,OnePlus,ONE E1003
228,NaN,NaN,NaN,22803,android,ONE E1003,OnePlus,ONE E1003
229,NaN,NaN,NaN,22803,android,ONE E1003,OnePlus,ONE E1003
230,NaN,NaN,NaN,22877,android,ONE E1003,OnePlus,ONE E1003
231,NaN,NaN,NaN,22877,android,ONE E1003,OnePlus,ONE E1003

In [84]:
merge_device_manufacturer.groupby("Manufacturer").agg({'use_id' : 'count', 'outgoing_mins_per_month' : 'mean', 'outgoing_sms_per_month' : 'mean', 'monthly_mb' : 'mean'})

,use_id,outgoing_mins_per_month,outgoing_sms_per_month,monthly_mb
Manufacturer,,,,
HTC,47,299.842955,93.059318,5144.077955
Huawei,6,81.526667,9.500000,1561.226667
LGE,3,111.530000,12.760000,1557.330000
Lava,2,60.650000,261.900000,12458.670000
Lenovo,2,215.920000,12.930000,1557.330000
Motorola,16,95.127500,65.666250,3946.500000
OnePlus,12,354.855000,48.330000,6575.410000
Samsung,126,191.010093,92.390463,4017.318889
Sony,16,177.315625,40.176250,3212.000625
Vodafone,1,42.750000,46.830000,5191.120000
ZTE,1,42.750000,46.830000,5191.120000